interfaces/src/main/resources/templates/GeefOnderneming/02.00.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="http://webservice.geefondernemingdienst-02_00.onderneming-02_00.vip.vlaanderen.be">
    <soapenv:Header/>
    <soapenv:Body>
        <web:GeefOnderneming>
            <Verzoek>
                <Context>
                    <Naam>GeefOnderneming</Naam>
                    <Versie>02.00.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2025-01-01</Datum>
                            <Tijd>12:00</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>Identificatie</Identificatie>
                            <Referte>Referte</Referte>
                            <Hoedanigheid>Hoedanigheid</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>Referte</Referte>
                        <Inhoud>
                            <Criteria>
                                <Ondernemingsnummer>0123456789</Ondernemingsnummer>
                                <Basisgegevens>0</Basisgegevens>
                                <Rechtstoestanden>0</Rechtstoestanden>
                                <Vestigingen>
                                    <Aanduiding>0</Aanduiding>
                                    <Details>0</Details>
                                </Vestigingen>
                                <Omschrijvingen>
                                    <Aanduiding>0</Aanduiding>
                                </Omschrijvingen>
                                <Datums>
                                    <Periode>
                                        <Begin>2025-01-01</Begin>
                                        <Einde>2026-01-01</Einde>
                                    </Periode>
                                </Datums>
                            </Criteria>
                            <Taal>nl</Taal>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </web:GeefOnderneming>
    </soapenv:Body>
</soapenv:Envelope>